# CannotHaveArcs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..CannotHaveArcs Property
BuiltInFailures..::..SketchFailures Class See Also
---
Sorry, we can't use arcs here.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotHaveArcs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotHaveArcs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotHaveArcs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace